# b3lite_ablation_agfpn.yaml
# +A-GFPN only
# RepHFE -> Upsample
# SADH -> Detect

nc: 5
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0
  - [-1, 1, Conv, [128, 3, 2]]      # 1
  - [-1, 3, C2f, [128, True]]       # 2

  - [-1, 1, Conv, [256, 3, 2]]      # 3
  - [-1, 6, C2f, [256, True]]       # 4  P3

  - [-1, 1, Conv, [512, 3, 2]]      # 5
  - [-1, 6, C2f, [512, True]]       # 6  P4

  - [-1, 1, Conv, [1024, 3, 2]]     # 7
  - [-1, 3, C2f, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9  P5

head:
  - [-1, 1, Conv, [512, 1, 1]]                  # 10
  - [6, 1, Conv, [512, 3, 2]]                   # 11
  - [[10, 11], 1, Concat, [1]]                  # 12
  - [-1, 1, CSPStage, [512]]                    # 13  P5_out

  - [13, 1, Conv, [256, 1, 1]]                  # 14
  - [-1, 1, nn.Upsample, [None, 2, nearest]]    # 15
  - [4, 1, Conv, [256, 3, 2]]                   # 16
  - [[15, 16, 6], 1, Concat, [1]]               # 17
  - [-1, 1, CSPStage, [256]]                    # 18  N4_mid

  - [18, 1, Conv, [256, 1, 1]]                  # 19
  - [-1, 1, nn.Upsample, [None, 2, nearest]]    # 20
  - [[20, 4], 1, Concat, [1]]                   # 21
  - [-1, 1, CSPStage, [256]]                    # 22  P3_out

  - [22, 1, Conv, [256, 3, 2]]                  # 23
  - [[23, 18], 1, Concat, [1]]                  # 24
  - [-1, 1, CSPStage, [256]]                    # 25  P4_out

  - [[22, 25, 13], 1, Detect, [nc]]             # 26