# Canonical B3: A-GFPN only, standard upsampling and Detect head.
nc: 5
scale: n
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [6, 1, Conv, [512, 3, 2]]
  - [[10, 11], 1, Concat, [1]]
  - [-1, 1, CSPStage, [512]]
  - [13, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [4, 1, Conv, [256, 3, 2]]
  - [[15, 16, 6], 1, Concat, [1]]
  - [-1, 1, CSPStage, [256]]
  - [18, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, nearest]]
  - [[20, 4], 1, Concat, [1]]
  - [-1, 1, CSPStage, [256]]
  - [22, 1, Conv, [256, 3, 2]]
  - [[23, 18], 1, Concat, [1]]
  - [-1, 1, CSPStage, [256]]
  - [[22, 25, 13], 1, Detect, [nc]]
