# Pairwise ablation B7: RepHFE + SADH, with the standalone PAN-FPN path.
nc: 5
scale: n
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, RepHFE, [256]]
  - [[11, 6], 1, Concat, [1]]
  - [-1, 1, CSPStage, [256]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, RepHFE, [256]]
  - [[15, 4], 1, Concat, [1]]
  - [-1, 1, CSPStage, [256]]
  - [17, 1, Conv, [256, 3, 2]]
  - [[18, 13], 1, Concat, [1]]
  - [-1, 1, CSPStage, [256]]
  - [20, 1, Conv, [256, 3, 2]]
  - [[21, 10], 1, Concat, [1]]
  - [-1, 1, CSPStage, [256]]
  - [[17, 20, 23], 1, Detect_LSCSBD, [nc, 256]]
