# b3lite_ablation_sadh.yaml
# +SADH only
# Standard PAN-FPN
# RepHFE removed

nc: 5
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]       # 0
  - [-1, 1, Conv, [128, 3, 2]]      # 1
  - [-1, 3, C2f, [128, True]]       # 2

  - [-1, 1, Conv, [256, 3, 2]]      # 3
  - [-1, 6, C2f, [256, True]]       # 4  P3

  - [-1, 1, Conv, [512, 3, 2]]      # 5
  - [-1, 6, C2f, [512, True]]       # 6  P4

  - [-1, 1, Conv, [1024, 3, 2]]     # 7
  - [-1, 3, C2f, [1024, True]]      # 8
  - [-1, 1, SPPF, [1024, 5]]        # 9  P5

head:
  - [-1, 1, Conv, [256, 1, 1]]                  # 10
  - [-1, 1, nn.Upsample, [None, 2, nearest]]    # 11
  - [[11, 6], 1, Concat, [1]]                   # 12
  - [-1, 1, CSPStage, [256]]                    # 13

  - [-1, 1, Conv, [256, 1, 1]]                  # 14
  - [-1, 1, nn.Upsample, [None, 2, nearest]]    # 15
  - [[15, 4], 1, Concat, [1]]                   # 16
  - [-1, 1, CSPStage, [256]]                    # 17  P3_out

  - [17, 1, Conv, [256, 3, 2]]                  # 18
  - [[18, 13], 1, Concat, [1]]                  # 19
  - [-1, 1, CSPStage, [256]]                    # 20  P4_out

  - [20, 1, Conv, [256, 3, 2]]                  # 21
  - [[21, 10], 1, Concat, [1]]                  # 22
  - [-1, 1, CSPStage, [256]]                    # 23  P5_out

  - [[17, 20, 23], 1, Detect_LSCSBD, [nc, 256]] # 24