# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# 0-P1/2
# 1-P2/4
# 2-P3/8
# 3-P4/16
# 4-P5/32

# 创新模块-将两个module进行融合 
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, convnextv2_atto, []]  # 4
  - [-1, 1, SPPF, [1024, 5]]  # 5

# YOLOv8.0n head
head:
  - [-1, 1, Conv, [512, 1, 1]] # 6
  - [3, 1, Conv, [512, 3, 2]] # 7
  - [[-1, 6], 1, Concat, [1]] # 8
  - [-1, 3, CSPStage, [512]] # 9 P5/32

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10 # P4/16
  - [2, 1, Conv, [256, 3, 2]]  # 11 # P3/8 采用下采样卷积
  - [[10, -1, 3], 1, Concat, [1]]  # 12 # P4/16
  - [-1, 3, CSPStage, [512]]  # 13 # P4/16

 # 相关性的延申,按照最复杂的情况去处理P3层+实现
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14 #P3/8
  - [1, 1, Conv, [128, 3, 2]]  # 15 # P3/8 采用下采样卷积
  - [[14, -1, 2], 1, Concat, [1]] # 16 # P3/8
  - [-1, 3, CSPStage, [256]] # 17 # P3/8 

# 同样的方式进行P2层的添加
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 18 # P2/4
  - [[-1, 1], 1, Concat, [1]] # 19 # P2/4
  - [-1, 3, CSPStage, [256]] # 20 # P2/4

# 同样方式进行下采样
  - [-1, 1, Conv, [256, 3, 2]] # 21 # P3/8
  - [[-1, 17], 1, Concat, [1]] # 22 # P3/8
  - [-1, 3, CSPStage, [512]] # 23

# 同样的方式进行下采样
  - [17, 1, Conv, [256, 3, 2]] # 24  # P4/16
  - [23, 1, Conv, [256, 3, 2]] # 25 # P5/32
  - [[13, 24, -1], 1, Concat, [1]] # 26 # P5/32
  - [-1, 3, CSPStage, [1024]] # 27

# 再加一个P5操作
  - [13, 1, Conv, [256, 3, 2]] # 28
  - [27, 1, Conv, [256, 3, 2]] # 29
  - [[9, 28, -1], 1, Concat, [1]] # 30
  - [-1, 3, CSPStage, [1024]] # 31 P5

  - [[20, 23, 27, 31], 1, Detect, [nc]]  # Detect(P3, P4, P5)

