# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 Enhanced Configuration: C2f_iRMB + EUCB_SC + Detect_LSCSBD
# 
# 优化策略：渐进式特征增强 + 自适应注意力 + 轻量检测头
# 适用场景：精度优先，中小目标检测，金属表面缺陷检测等
#
# 主要改进：
# 1. 多尺度C2f_iRMB配置：浅层小kernel保留细节，深层大kernel增强语义
# 2. EUCB_SC上采样：保留更多细节特征，减少信息损失
# 3. Detect_LSCSBD：轻量解耦头，平衡精度和速度
# 4. 自适应SE注意力：不同层级使用不同se_ratio策略

# Parameters
nc: 6  # number of classes (根据实际数据集修改)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # nano版本
  s: [0.33, 0.50, 1024]  # small版本
  m: [0.67, 0.75, 768]   # medium版本
  l: [1.00, 1.00, 512]   # large版本
  x: [1.00, 1.25, 512]   # xlarge版本

# YOLOv8 Backbone with Progressive C2f_iRMB
backbone:
  # [from, repeats, module, args]
  # C2f_iRMB args: [c2, kernel_size, se_ratio, use_channel_attn, window_size]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2 (640->320)
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4 (320->160)
  
  # P2层：浅层特征，保留细节
  - [-1, 3, C2f_iRMB, [128, 5, 0.25, True, 5]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8 (160->80)
  
  # P3层：中等特征，平衡细节和语义
  - [-1, 6, C2f_iRMB, [256, 5, 0.25, True, 7]]  # 4 
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16 (80->40)
  
  # P4层：深层特征，增强感受野
  - [-1, 6, C2f_iRMB, [512, 7, 0.125, True, 7]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32 (40->20)
  
  # P5层：最深特征，关注全局语义
  - [-1, 3, C2f_iRMB, [1024, 7, 0.125, False, 7]]  # 8
  - [-1, 1, SPPF, [1024, 5]]  # 9 (多尺度池化增强感受野)

# YOLOv8 Head with EUCB_SC + LSCSBD
head:
  # ==================== FPN上采样路径 ====================
  # 使用EUCB_SC替代标准Upsample，保留更多细节特征
  - [-1, 1, EUCB_SC, []]  # 10: P5->P4尺度 (20->40)
  - [[-1, 6], 1, Concat, [1]]  # 11: cat backbone P4
  - [-1, 3, C2f_iRMB, [512, 5, 0.25, True, 7]]  # 12 (P4/16-medium)
  
  - [-1, 1, EUCB_SC, []]  # 13: P4->P3尺度 (40->80)
  - [[-1, 4], 1, Concat, [1]]  # 14: cat backbone P3
  - [-1, 3, C2f, [256, True]]  # 15 (P3/8-small)
  
  # ==================== PAN下采样路径 ====================
  
  - [-1, 1, Conv, [256, 3, 2]]  # 16: P3->P4尺度 (80->40)
  - [[-1, 12], 1, Concat, [1]]  # 17: cat head P4
  - [-1, 3, C2f_iRMB, [512, 7, 0.125, True, 7]]  # 18 (P4/16-medium)
  
  - [-1, 1, Conv, [512, 3, 2]]  # 19: P4->P5尺度 (40->20)
  - [[-1, 9], 1, Concat, [1]]  # 20: cat head P5
  - [-1, 3, C2f_iRMB, [1024, 7, 0.125, False, 7]]  # 21 (P5/32-large)
  
  # ==================== 检测头 ====================
  # Detect_LSCSBD: 轻量共享卷积+独立BN检测头
  # args: [nc, hidc]
  # - nc: 类别数
  # - hidc: 隐藏层通道数 (256为标准配置)
  # 自动特性：
  #   - P3配置自动使用reg_max=16
  #   - 最深层自动使用深度可分离卷积
  - [[15, 18, 21], 1, Detect_LSCSBD, [nc, 256]]  # Detect(P3, P4, P5)


# ==================== 配置说明 ====================
# 
# 1. C2f_iRMB参数调优策略：
#    - kernel_size: 浅层5, 深层7 (感受野渐进增大)
#    - se_ratio: 浅层0.25, 深层0.125 (减少深层计算量)
#    - use_channel_attn: P5关闭以提升速度
#    - window_size: 根据特征图尺寸调整 (5-7)
#
# 2. EUCB_SC优势：
#    - 深度可分离上采样，参数量小
#    - 通道混洗增强特征多样性
#    - 相比双线性插值保留更多细节
#
# 3. Detect_LSCSBD优势：
#    - 共享卷积层减少参数
#    - 独立BN保持检测精度
#    - 自适应深度可分离策略
#
# 4. 训练建议：
#    - imgsz: 640 (标准) / 1280 (高精度)
#    - batch: 根据显存调整 (16/32/64)
#    - optimizer: AdamW (推荐) / SGD
#    - lr0: 0.001 (AdamW) / 0.01 (SGD)
#    - mosaic: 1.0 (数据增强)
#    - mixup: 0.1 (可选)
#    - 损失函数: 可配合Wise-IoU/Focal Loss
#
# 5. 推理优化：
#    - half=True (FP16推理)
#    - device=0 (单卡) / 0,1,2,3 (多卡)
#    - conf=0.25, iou=0.45 (NMS阈值)

