# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # ---- P1/2 ----
  - [-1, 1, Conv, [64, 3, 2]]          # 0: s=2
  - [-1, 1, Conv, [128, 3, 2]]         # 1: s=4  -> P2 输入通道
  - [-1, 3, C2f, [128, True]]          # 2: P2 (保持原生C2f以保锐)
  # ---- P3/8 ----
  - [-1, 1, Conv, [256, 3, 2]]         # 3: s=8
  - [-1, 6, C2f_iRMB_DRB, [256, 5, False, 1, 0.5]]   # 4: P3  DRB, dw_ks=5
  # ---- P4/16 ---
  - [-1, 1, Conv, [512, 3, 2]]         # 5: s=16
  - [-1, 6, C2f_iRMB_SWC, [512, 13, False, 2, 0.5]]  # 6: P4  SWC, 大核21
  # ---- P5/32 ---
  - [-1, 1, Conv, [1024, 3, 2]]        # 7: s=32
  - [-1, 3, C2f_iRMB_SWC, [1024, 17, False, 2, 0.5]] # 8: P5  SWC, 大核31
  - [-1, 1, SPPF, [1024, 5]]           # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10: P5->P4
  - [[-1, 6], 1, Concat, [1]]                    # 11: cat backbone P4
  - [-1, 3, C2f_GhostDynamicConv, [512]]                          # 12: P4 (td)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13: P4->P3
  - [[-1, 4], 1, Concat, [1]]                    # 14: cat backbone P3
  - [-1, 3, C2f_GhostDynamicConv, [256]]                          # 15: P3 (td)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 16: P3->P2
  - [[-1, 2], 1, Concat, [1]]                    # 17: cat backbone P2
  - [-1, 3, C2f_GhostDynamicConv, [128]]                          # 18: P2 (td) —— 新增的最小层

  # bottom-up 回流与原PAN保持一致，从P2回到P3再向上
  - [-1, 1, Conv, [128, 3, 2]]                   # 19: P2->P3
  - [[-1, 15], 1, Concat, [1]]                   # 20: 与P3(td)融合
  - [-1, 3, C2f_GhostDynamicConv, [256]]                          # 21: P3 (bu/refine)

  - [-1, 1, Conv, [256, 3, 2]]                   # 22: P3->P4
  - [[-1, 12], 1, Concat, [1]]                   # 23: 与P4(td)融合
  - [-1, 3, C2f_GhostDynamicConv, [512]]                          # 24: P4 (bu/refine)

  - [-1, 1, Conv, [512, 3, 2]]                   # 25: P4->P5
  - [[-1, 9], 1, Concat, [1]]                    # 26: 与SPPF融合
  - [-1, 3, C2f_GhostDynamicConv, [1024]]                         # 27: P5 (bu/refine)

  # head
  - [[18, 21, 24, 27], 1, Detect_LSCSBD, [nc, 256]]
