# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 优化配置：C2f_iRMB + EUCB_SC + Detect_LSCSBD
# 
# 模块说明：
# 1. C2f_iRMB: 使用iRMB_DRB增强的特征提取模块，提升检测精度
#    参数：[c2, kernel_size, se_ratio, use_channel_attn, window_size]
#    - kernel_size: DRB核大小，5用于细节特征，7用于更大感受野
#    - se_ratio: SE注意力缩减比例，0.25平衡精度和速度
#    - use_channel_attn: 是否启用ECA通道注意力（True提升精度，False提升速度）
#    - window_size: 窗口注意力大小，7为标准值
#
# 2. EUCB_SC: 增强上采样卷积块，带通道混洗机制
#    用于替代标准Upsample，提升特征融合质量
#
# 3. Detect_LSCSBD: 轻量级共享卷积+独立BN检测头
#    优势：参数共享减少计算量，独立BN保持各尺度特征区分度
#    支持P3-P5（3头，reg_max=16）或P2-P5（4头，reg_max=12）
#
# 优化策略：
# - Backbone：使用C2f_iRMB替代C2f，增强特征提取能力
# - Head上采样：使用EUCB_SC替代标准Upsample，提升融合质量
# - 检测头：使用Detect_LSCSBD，在保持精度的同时降低参数量
# - 分层策略：浅层用较小kernel(5)，深层用较大kernel(7)以平衡精度和速度
#
# 配置选择：
# 版本A（当前）：P3-P5检测头（3个层：15,18,21），平衡精度和速度 ✅
# 版本B（可选）：P2-P5检测头（4个层：18,21,24,27），更高精度但略慢
#   修改方法：
#   1. 取消注释P2上采样层（第79-81行）
#   2. 注释版本A的最后一行（第97行）
#   3. 取消注释版本B的最后一行（第101行）

# Parameters
nc: 6
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8 Backbone with C2f_iRMB
backbone:
  # [from, repeats, module, args]
  # args: [c2, kernel_size, se_ratio, use_channel_attn, window_size]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  
  # P2层：浅层特征，使用较小kernel和通道注意力
  - [-1, 3, C2f_iRMB, [128, 5, 0.25, True, 7]]  # 2
  
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  # P3层：中等特征，使用较大kernel以捕获更多上下文
  - [-1, 6, C2f_iRMB, [256, 7, 0.25, True, 7]]  # 4
  
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  # P4层：深层特征，使用较大kernel和较小se_ratio以平衡精度和速度
  - [-1, 6, C2f_iRMB, [512, 7, 0.125, True, 7]]  # 6
  
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  # P5层：最深特征，关闭通道注意力以提升速度
  - [-1, 3, C2f_iRMB, [1024, 7, 0.125, False, 7]]  # 8
  
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8 Head with EUCB_SC upsampling
head:
  # FPN上采样路径（使用EUCB_SC替代标准Upsample）
  - [-1, 1, EUCB_SC, []]  # 10: 上采样P5到P4尺度
  - [[-1, 6], 1, Concat, [1]]  # 11: cat backbone P4
  # 融合层：使用C2f_iRMB进一步提取特征
  - [-1, 3, C2f_iRMB, [512, 5, 0.25, True, 7]]  # 12 (P4/16-medium)
  
  - [-1, 1, EUCB_SC, []]  # 13: 上采样到P3尺度
  - [[-1, 4], 1, Concat, [1]]  # 14: cat backbone P3
  - [-1, 3, C2f_iRMB, [256, 5, 0.25, True, 7]]  # 15 (P3/8-small)
  
  # 可选：P2上采样层（仅在P2-P5配置时启用）
  - [-1, 1, EUCB_SC, []]  # 上采样到P2尺度
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P2
  - [-1, 3, C2f_iRMB, [128, 5, 0.25, True, 7]]  # 18 (P2/4-tiny)
  
  # PAN下采样路径
  - [-1, 1, Conv, [256, 3, 2]]  # 16: 下采样P3到P4尺度
  - [[-1, 12], 1, Concat, [1]]  # 17: cat head P4
  - [-1, 3, C2f_iRMB, [512, 7, 0.125, True, 7]]  # 18 (P4/16-medium)
  
  - [-1, 1, Conv, [512, 3, 2]]  # 19: 下采样P4到P5尺度
  - [[-1, 9], 1, Concat, [1]]  # 20: cat head P5
  - [-1, 3, C2f_iRMB, [1024, 7, 0.125, False, 7]]  # 21 (P5/32-large)
  
  # 检测头：Detect_LSCSBD
  # 参数：[nc, hidc, ch, reg_max, shared_layers, dw_per_level, norm]
  # ch会自动从输入层获取，reg_max自动选择（P3-P5用16，P2-P5用12）
  
  # 版本A：P3-P5配置（3个检测头，平衡精度和速度）✅ 当前启用
  # - [[15, 18, 21], 1, Detect_LSCSBD, [nc, 256]]  # Detect(P3, P4, P5)
  
  # 版本B：P2-P5配置（4个检测头，更高精度）⚠️ 需取消注释并注释版本A
  # 注意：使用P2配置时，需取消上面P2上采样层的注释
  - [[18, 21, 24, 27], 1, Detect_LSCSBD, [nc, 256]]  # Detect(P2, P3, P4, P5)

