# Ultralytics YOLO 🚀, AGPL-3.0 license

nc: 10  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone (保持不变)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 3, C2f, [128, True]]    # 2-P2
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8
  - [-1, 6, C2f, [256, True]]    # 4-P3
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16
  - [-1, 6, C2f, [512, True]]    # 6-P4
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]   # 8-P5
  - [-1, 1, SPPF, [1024, 5]]     # 9-P5 (SPPF 输出)


head:
  - [-1, 1, Conv, [512, 1, 1]]        # 10: P5降维 (9 -> 512)
  - [6, 1, Conv, [512, 3, 2]]         # 11: P4下采样到P5尺度
  - [[-1, 10], 1, Concat, [1]]        # 12: [P4↓, P5]
  - [-1, 3, CSPStage, [512]]          # 13: F5 (P5 融合特征)

  - [-1, 1, EUCB_SC, []]      
  - [4, 1, Conv, [256, 3, 2]]         # 15: P3 → P4 下采样
  - [[14, -1, 6], 1, Concat, [1]]     # 16: [F5↑, P3↓, P4原始]  (此处 -1 指 15)
  - [-1, 3, CSPStage, [512]]          # 17: F4_mid (P4 融合特征)

  - [-1, 1, DySample, [2, 'lp']]      # 18: F4_mid → P3 上采样
  - [[-1, 4], 1, Concat, [1]]         # 19: [F4_mid↑, P3原始]  (18 + 4)
  - [-1, 3, CSPStage, [256]]          # 20: F3_mid (P3 融合特征)

  - [-1, 1, DySample, [2, 'lp']]      # 21: F3_mid → P2 上采样
  - [[-1, 2], 1, Concat, [1]]         # 22: [F3_mid↑, P2原始]  (21 + 2)
  - [-1, 3, CSPStage, [128]]          # 23: F2 (P2 融合特征，通道 128)

  - [20, 1, Conv, [256, 3, 2]]        # 24: F3_mid → P4 (下采样)
  - [[-1, 17], 1, Concat, [1]]        # 25: [F3_mid↓, F4_mid]  (24 + 17)
  - [-1, 3, CSPStage, [512]]          # 26: F4_final (P4 最终特征)

  - [26, 1, Conv, [512, 3, 2]]        # 27: F4_final → P5 (下采样)
  - [[-1, 13], 1, Concat, [1]]        # 28: [F4_final↓, F5]    (27 + 13)
  - [-1, 3, CSPStage, [1024]]         # 29: F5_final (P5 最终特征)

  - [[23, 20, 26, 29], 1, Detect_LSCSBD, [nc, 256]]  # P2, P3, P4, P5
