# Ultralytics YOLO 🚀, AGPL-3.0 license

nc: 5  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 3, C2f_SCConv, [128, True]]    # 2-P2
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8
  - [-1, 6, C2f_SCConv, [256, True]]   # 4-P3
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16
  - [-1, 6, C2f_SCConv, [512, True]]    # 6-P4
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_SCConv, [1024, True]]   # 8-P5
  - [-1, 1, SPPF, [1024, 5]]     # 9-P5 (SPPF 输出)

head:
  - [-1, 1, Conv, [512, 1, 1]]        # 10
  - [6, 1, Conv, [512, 3, 2]]         # 11
  - [[-1, 10], 1, Concat, [1]]        # 12
  - [-1, 3, C2f_SCConv, [512, True]]  # 13: F5

  - [-1, 1, EUCB_SC, []]              # 14: F5 -> up to P4 (通道仍为512)
  - [-1, 1, Conv, [256, 1, 1]]        # 15: align F5_up 512->256

  - [4, 1, Conv, [256, 3, 2]]         # 16: P3 -> down to P4 (256)
  - [6, 1, Conv, [256, 1, 1]]         # 17: align P4_raw 512->256

  - [[15, 16, 17], 1, Concat, [1]]    # 18: 256+256+256
  - [-1, 3, C2f_SCConv, [256, True]]  # 19: F4_mid

  - [-1, 1, EUCB_SC, []]              # 20: F4_mid up -> P3 (通道=256)
  - [4, 1, Conv, [256, 1, 1]]         # 21: align P3_raw (256->256, 明确化)
  - [[-1, 21], 1, Concat, [1]]        # 22
  - [-1, 3, C2f_SCConv, [256, True]]  # 23: F3_mid

  - [-1, 1, EUCB_SC, []]              # 24: F3_mid up -> P2 (通道=256)
  - [-1, 1, Conv, [128, 1, 1]]        # 25: align up (256->128)
  - [2, 1, Conv, [128, 1, 1]]         # 26: align P2_raw (128->128)
  - [[25, 26], 1, Concat, [1]]        # 27
  - [-1, 3, C2f_SCConv, [128, True]]  # 28: F2

  - [23, 1, Conv, [256, 3, 2]]        # 29: F3_mid -> P4
  - [[-1, 19], 1, Concat, [1]]        # 30
  - [-1, 3, C2f_SCConv, [256, True]]  # 31: F4_final

  - [31, 1, Conv, [512, 3, 2]]        # 32: -> P5
  - [[-1, 13], 1, Concat, [1]]        # 33
  - [-1, 3, C2f_SCConv, [512, True]]  # 34: F5_final

  - [[28, 23, 31, 34], 1, Detect_LSCSBD, [nc, 256]]  # ECA in head
