# Ultralytics YOLO 🚀, AGPL-3.0 license
# GDFPN neck hybrid (P5 DySample+EUCB_SC 并行)，P4/P3 用 EUCB_SC，P2 轻量，LSCSBD 四头

nc: 5
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 3, C2f_SCConv, [128, True]]    # 2-P2
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8
  - [-1, 6, C2f_SCConv, [256, True]]    # 4-P3
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16
  - [-1, 6, C2f_SCConv, [512, True]]    # 6-P4
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_SCConv, [1024, True]]   # 8-P5
  - [-1, 1, SPPF, [1024, 5]]     # 9-P5

head:
  - [-1, 1, Conv, [512, 1, 1]]          # 10: P5 lateral
  - [6,  1, Conv, [512, 3, 2]]          # 11: P4 -> P5
  - [[-1, 10], 1, Concat, [1]]          # 12
  - [-1, 2, CSPStage, [512]]            # 13: F5 base

  - [13, 1, EUCB_SC, []]                # 14: EUCB up
  - [13, 1, DySample, [2, 'lp']]        # 15: DySample up
  - [14, 1, Conv, [256, 1, 1]]          # 16: align EUCB
  - [15, 1, Conv, [256, 1, 1]]          # 17: align DySample
  - [6,  1, Conv, [256, 1, 1]]          # 18: P4 raw align
  - [[16, 17, 18], 1, Concat, [1]]      # 19
  - [-1, 2, CSPStage, [256]]            # 20: F4 mid

  - [20, 1, EUCB_SC, []]                # 21: F4 -> P3
  - [-1, 1, Conv, [128, 1, 1]]          # 22: align up
  - [4,  1, Conv, [128, 1, 1]]          # 23: P3 raw
  - [[22, 23], 1, Concat, [1]]          # 24
  - [-1, 2, CSPStage, [128]]            # 25: F3 mid

  - [25, 1, EUCB_SC, []]                # 26: F3 -> P2
  - [-1, 1, Conv, [128, 1, 1]]          # 27: align up
  - [2,  1, Conv, [128, 1, 1]]          # 28: P2 raw
  - [[27, 28], 1, Concat, [1]]          # 29
  - [-1, 2, CSPStage, [128]]            # 30: F2

  - [25, 1, Conv, [256, 3, 2]]          # 31: F3 -> P4
  - [[31, 20], 1, Concat, [1]]          # 32
  - [-1, 2, CSPStage, [256]]            # 33: F4 final
  - [33, 1, Conv, [512, 3, 2]]          # 34: F4 -> P5
  - [[34, 13], 1, Concat, [1]]          # 35
  - [-1, 2, CSPStage, [512]]            # 36: F5 final

  - [[30, 25, 33, 36], 1, Detect_LSCSBD, [nc, 256]]  # Detect P2,P3,P4,P5, residual SE in head
