# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P2-P5 outputs.

# Parameters
nc: 6
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]      # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]     # 1-P2/4
  - [-1, 3, C2f_GhostDynamicConv_Top1, [128, True]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]     # 3-P3/8
  - [-1, 6, C2f_GhostDynamicConv_Top1, [256, True]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]     # 5-P4/16
  - [-1, 6, C2f_GhostDynamicConv_Top1, [512, True]]      # 6
  - [-1, 1, Conv, [1024, 3, 2]]    # 7-P5/32
  - [-1, 3, C2f_GhostDynamicConv_Top1, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]       # 9

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10: P5->P4
  - [[-1, 6], 1, Concat, [1]]                    # 11: cat backbone P4
  - [-1, 3, C2f_GhostDynamicConv_Top1, [512]]                          # 12: P4 (td)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13: P4->P3
  - [[-1, 4], 1, Concat, [1]]                    # 14: cat backbone P3
  - [-1, 3, C2f_GhostDynamicConv_Top1, [256]]                          # 15: P3 (td)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 16: P3->P2
  - [[-1, 2], 1, Concat, [1]]                    # 17: cat backbone P2
  - [-1, 3, C2f_GhostDynamicConv_Top1, [128]]                          # 18: P2 (td) —— 新增的最小层

  # bottom-up 回流与原PAN保持一致，从P2回到P3再向上
  - [-1, 1, Conv, [128, 3, 2]]                   # 19: P2->P3
  - [[-1, 15], 1, Concat, [1]]                   # 20: 与P3(td)融合
  - [-1, 3, C2f_GhostDynamicConv_Top1, [256]]                          # 21: P3 (bu/refine)

  - [-1, 1, Conv, [256, 3, 2]]                   # 22: P3->P4
  - [[-1, 12], 1, Concat, [1]]                   # 23: 与P4(td)融合
  - [-1, 3, C2f_GhostDynamicConv_Top1, [512]]                          # 24: P4 (bu/refine)

  - [-1, 1, Conv, [512, 3, 2]]                   # 25: P4->P5
  - [[-1, 9], 1, Concat, [1]]                    # 26: 与SPPF融合
  - [-1, 3, C2f_GhostDynamicConv_Top1, [1024]]                         # 27: P5 (bu/refine)

  # head
  - [[18, 21, 24, 27], 1, Detect_LSCSBD, [nc, 256]]
