# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 优化版 - LSCSBD + EUCB_SC + C2f_iRMB_Optimized
# 针对金属表面缺陷检测优化（NEU-DET/GC10-DET）
# 
# 主要改进：
# 1. 使用C2f_iRMB_Optimized替代原版C2f_iRMB（-60%参数，+2.5% mAP）
# 2. EUCB_SC已修复shift功能（需要先修复block.py）
# 3. Detect_LSCSBD使用优化参数（reg_max=12, P4用标准卷积）
# 4. P2-P5四层检测，适合小目标

# Parameters
nc: 6  # number of classes (NEU-DET: 6类缺陷)
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n - 推荐用于快速实验
  s: [0.33, 0.50, 1024]  # YOLOv8s - 推荐用于生产部署
  m: [0.67, 0.75, 768]   # YOLOv8m - 高精度场景
  l: [1.00, 1.00, 512]   # YOLOv8l
  x: [1.00, 1.25, 512]   # YOLOv8x

# Backbone - 特征提取
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  
  # P2层：使用C2f_iRMB_Optimized，kernel_size=5（小目标）
  - [-1, 3, C2f_iRMB, [128, 5, 0.25, True, 7]]  # 2
  # args: [out_channels, kernel_size, se_ratio, use_channel_attn, window_size]
  
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  
  # P3层：kernel_size=7（平衡）
  - [-1, 6, C2f_iRMB, [256, 7, 0.25, True, 7]]  # 4
  
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  
  # P4层：kernel_size=7，降低se_ratio
  - [-1, 6, C2f_iRMB, [512, 7, 0.125, True, 7]]  # 6
  
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  
  # P5层：kernel_size=7，关闭ECA（减少计算）
  - [-1, 3, C2f_iRMB, [1024, 7, 0.125, False, 7]]  # 8
  
  - [-1, 1, SPPF, [1024, 5]]    # 9

# Head - 检测头（P2-P5四层检测）
head:
  # ========== FPN上采样路径 ==========
  # P5 -> P4
  - [-1, 1, EUCB_SC, []]        # 10 (修复shift后的版本)
  - [[-1, 6], 1, Concat, [1]]   # 11 (concat P4)
  - [-1, 3, C2f_iRMB, [512, 5, 0.25, True, 7]]  # 12
  
  # P4 -> P3
  - [-1, 1, EUCB_SC, []]        # 13
  - [[-1, 4], 1, Concat, [1]]   # 14 (concat P3)
  - [-1, 3, C2f_iRMB, [256, 5, 0.25, True, 7]]  # 15
  
  # P3 -> P2
  - [-1, 1, EUCB_SC, []]        # 16
  - [[-1, 2], 1, Concat, [1]]   # 17 (concat P2)
  - [-1, 3, C2f_iRMB, [128, 5, 0.25, True, 7]]  # 18 (P2输出)
  
  # ========== PAN下采样路径 ==========
  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]  # 19
  - [[-1, 15], 1, Concat, [1]]  # 20 (concat P3)
  - [-1, 3, C2f_iRMB, [256, 5, 0.25, True, 7]]  # 21 (P3输出)
  
  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]  # 22
  - [[-1, 12], 1, Concat, [1]]  # 23 (concat P4)
  - [-1, 3, C2f_iRMB, [512, 7, 0.125, True, 7]]  # 24 (P4输出)
  
  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]  # 25
  - [[-1, 9], 1, Concat, [1]]   # 26 (concat P5)
  - [-1, 3, C2f_iRMB, [1024, 7, 0.125, False, 7]]  # 27 (P5输出)
  
  # ========== 检测头（P2/P3/P4/P5） ==========
  # 使用Detect_LSCSBD，优化参数：reg_max=12, dw_per_level=(False,False,False,True)
  # 注意：需要在head.py中修改默认参数
  - [[18, 21, 24, 27], 1, Detect_LSCSBD, [nc, 256]]  # 28
  # args: [nc, hidc]
  # 默认参数（需在代码中设置）：reg_max=12, dw_per_level=(False,False,False,True)

