# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 6  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone

backbone:
  # ---- P1/2 ----
  - [-1, 1, Conv, [64, 3, 2]]           # 0
  - [-1, 1, Conv, [128, 3, 2]]          # 1 -> P2
  - [-1, 3, C2f, [128, True]]           # 2: P2，保持原生C2f以保锐

  # ---- P3/8 ----
  - [-1, 1, Conv, [256, 3, 2]]          # 3
  - [-1, 4, C2f_iRMB_DRB, [256, 5, False, 1, 0.5]]   # 4: P3，DRB稳定提边缘/多尺度

  # ---- P4/16 ----
  - [-1, 1, Conv, [512, 3, 2]]          # 5
  - [-1, 4, C2f_iRMB_Cascaded, [512]]   # 6: P4，局部窗口注意力（LocalWindowAttention）
  #- [-1, 4, C2f_iRMB_Cascaded, [512, False, 1, 0.5, 0.25]]

  # ---- P5/32 ----
  - [-1, 1, Conv, [1024, 3, 2]]         # 7
  - [-1, 2, C2f_iRMB_SWC, [1024, 17, False, 1, 0.5]] # 8: P5，SWC 中等大核(17)
  - [-1, 1, SPPF, [1024, 5]]            # 9

head:
  # FPN top-down金字塔网络
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 10: P5->P4
  - [[-1, 6], 1, Concat, [1]]                    # 11
  - [-1, 2, C2f_GhostDynamicConv, [512]]         # 12: P4(td)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13: P4->P3
  - [[-1, 4], 1, Concat, [1]]                    # 14
  - [-1, 2, C2f_GhostDynamicConv, [256]]         # 15: P3(td)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 16: P3->P2
  - [[-1, 2], 1, Concat, [1]]                    # 17
  #- [-1, 2, C2f_GhostDynamicConv, [128]]         # 18: P2(td)  —— 仅下游检测用
  # 替换 head 中的 18:
  - [-1, 2, C2f_iRMB_DRB, [128, 5, False, 1, 0.5]]  # 18: P2(td) 用 DRB 细化边缘

  # PAN bottom-up 路径聚合网络（只做 P3->P5 回流；P2 不向上回流）
  - [18, 1, Conv, [128, 3, 2]]                   # 19: P2->P3
  - [[-1, 15], 1, Concat, [1]]                   # 20
  - [-1, 2, C2f_GhostDynamicConv, [256]]         # 21: P3(bu)

  - [21, 1, Conv, [256, 3, 2]]                   # 22: P3->P4
  - [[-1, 12], 1, Concat, [1]]                   # 23
  - [-1, 2, C2f_GhostDynamicConv, [512]]         # 24: P4(bu)

  - [24, 1, Conv, [512, 3, 2]]                   # 25: P4->P5
  - [[-1, 9], 1, Concat, [1]]                    # 26
  - [-1, 2, C2f_GhostDynamicConv, [1024]]        # 27: P5(bu)

  # Detect (4-level)
  - [[18, 21, 24, 27], 1, Detect_LSCSBD, [nc, 256]]
