# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
# neck层面=现代的颈部的跨通道融合
# Parameters
nc: 6  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  # 卷积的这一层做的是3X3 stride 2 的下采样结构，把特征图的通道数扩展到64，金字塔的第一层，整体下采样倍数为/2; 提升下采样内容；
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f_iRMB, [512, 7, 0.25, True, 7]]  # 6-P4层
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f_iRMB, [1024, 7, 0.125, False, 7]]  # 8-P5层
  - [-1, 1, SPPF, [1024, 5]]  # 9

# DAMO-YOLO GFPN Head
head:
  # 第一阶段：P5-P4融合
  - [-1, 1, Conv, [512, 1, 1]]  # 10: P5降维
  - [6, 1, Conv, [512, 3, 2]]   # 11: P4下采样
  - [[-1, 10], 1, Concat, [1]]  # 12: 融合
  # ⭐ 使用C2f_iRMB替代CSPStage
  - [-1, 3, C2f_iRMB, [512, 7, 0.125, True, 7]]  # 13
  
  # 第二阶段：P4多尺度融合（核心节点）
  - [-1, 1, DySample, [2, 'lp']]  # 14: 动态上采样
  - [4, 1, Conv, [256, 3, 2]]     # 15: P3下采样
  - [[14, -1, 6], 1, Concat, [1]] # 16: 三路融合
  # ⭐ 关键节点使用C2f_iRMB
  - [-1, 3, C2f_iRMB, [512, 7, 0.25, True, 7]]  # 17 ⭐⭐⭐
  
  # 第三阶段：P3融合
  - [-1, 1, DySample, [2, 'lp']]  # 18
  - [[-1, 4], 1, Concat, [1]]     # 19
  # ⭐ P3使用标准C2f（速度优先）
  - [-1, 3, C2f, [256, True]]     # 20
  
  # 第四阶段：PAN路径
  - [-1, 1, Conv, [256, 3, 2]]    # 21
  - [[-1, 17], 1, Concat, [1]]    # 22
  - [-1, 3, C2f_iRMB, [512, 5, 0.25, True, 7]]  # 23
  
  # 第五阶段：全局聚合
  - [17, 1, Conv, [256, 3, 2]]    # 24
  - [23, 1, Conv, [256, 3, 2]]    # 25
  - [[13, 24, -1], 1, Concat, [1]] # 26
  - [-1, 3, C2f_iRMB, [1024, 7, 0.125, False, 7]]  # 27
  
  # ⭐ 检测头使用Detect_LSCSBD
  - [[20, 23, 27], 1, Detect, [nc]]