# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone

# ======= backbone（只保留两处最稳的增强）=======
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]              # P2 保原生 C2f
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, 5, False, 1, 0.5]]  # P3 仅留 DRB（细纹/边缘）
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C2f_iRMB_DRB, [512,5, False, 1, 0.5]]  # n=2, e=0.45
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C2f_iRMB_SWC, [1024, 17, False, 1, 0.5]] # P5 留一个大核 SWC（全局形状）
  - [-1, 1, SPPF, [1024, 5]]  

# ======= head（回归 C2f，P2 仅一处细化）=======
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C2f, [512]]   
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C2f_GhostDynamicConv_Top1, [256, False, 1, 0.45]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 1, C2f_iRMB_DRB, [128, 5, False, 1, 0.5]]   # P2 只保留一处 DRB 细化

  - [ -1, 1, Conv, [128, 3, 2] ]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, C2f, [256]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C2f, [512]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, C2f, [1024]]

  - [[18, 21, 24, 27], 1, Detect_LSCSBD, [nc, 256]]

