# Ultralytics YOLO 🚀, AGPL-3.0 license
# GDFPN neck with hybrid (DySample + EUCB_SC) P5->P4, EUCB_SC for lower paths, LSCSBD P2–P5 head.

nc: 5  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 3, C2f, [128, True]]    # 2-P2
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8
  - [-1, 6, C2f, [256, True]]    # 4-P3
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16
  - [-1, 6, C2f, [512, True]]    # 6-P4
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]   # 8-P5
  - [-1, 1, SPPF, [1024, 5]]     # 9-P5

head:
  # P5 base
  - [-1, 1, Conv, [512, 1, 1]]          # 10: P5 lateral
  - [6,  1, Conv, [512, 3, 2]]          # 11: P4 -> P5 downsample
  - [[-1, 10], 1, Concat, [1]]          # 12
  - [-1, 2, CSPStage, [512]]            # 13: F5 base (short)

  # Hybrid upsample to P4 (DySample + EUCB_SC)
  - [13, 1, EUCB_SC, []]                # 14: F5 up (EUCB_SC)
  - [13, 1, DySample, [2, 'lp']]        # 15: F5 up (DySample)
  - [14, 1, Conv, [256, 1, 1]]          # 16: align EUCB branch
  - [15, 1, Conv, [256, 1, 1]]          # 17: align DySample branch
  - [6,  1, Conv, [256, 1, 1]]          # 18: P4 lateral align
  - [[16, 17, 18], 1, Concat, [1]]      # 19
  - [-1, 2, CSPStage, [256]]            # 20: F4 mid (short)
  - [-1, 1, ECALite, [3]]               # 21: ECA after F4_mid (k=3)

  # P4->P3
  - [21, 1, EUCB_SC, []]                # 22: F4 up -> P3
  - [-1, 1, Conv, [128, 1, 1]]          # 23: align F4_up
  - [4,  1, Conv, [128, 1, 1]]          # 24: align P3 raw
  - [[23, 24], 1, Concat, [1]]          # 25
  - [-1, 2, CSPStage, [128]]            # 26: F3 mid
  - [-1, 1, ECALite, [3]]               # 27: ECA after F3_mid (k=3)

  # P3->P2
  - [27, 1, EUCB_SC, []]                # 28: F3 up -> P2
  - [-1, 1, Conv, [128, 1, 1]]          # 29: align F3_up
  - [2,  1, Conv, [128, 1, 1]]          # 30: align P2 raw
  - [[29, 30], 1, Concat, [1]]          # 31
  - [-1, 2, CSPStage, [128]]            # 32: F2 (P2)
  - [-1, 1, ECALite, [5]]               # 33: ECA after F2 (k=5)

  # Bottom-up refinements
  - [27, 1, Conv, [256, 3, 2]]          # 34: F3 mid -> P4
  - [[34, 21], 1, Concat, [1]]          # 35
  - [-1, 2, CSPStage, [256]]            # 36: F4 final

  - [36, 1, Conv, [512, 3, 2]]          # 37: F4 final -> P5
  - [[37, 13], 1, Concat, [1]]          # 38
  - [-1, 2, CSPStage, [512]]            # 39: F5 final

  - [[33, 27, 36, 39], 1, Detect_LSCSBD, [nc, 256]]  # Detect(P2,P3,P4,P5), residual SE in head
