# Ultralytics YOLO 🚀, AGPL-3.0 license

nc: 5  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 3, C2f, [128, True]]    # 2-P2
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4-P3
  - [-1, 1, Conv, [512, 3, 2]]   # 5-P4/16
  - [-1, 6, C2f, [512, True]]    # 6-P4
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]   # 8-P5
  - [-1, 1, SPPF, [1024, 5]]     # 9-P5 (SPPF 输出)

head:
  - [-1, 1, Conv, [512, 1, 1]]          # 10: P5 lateral (SPPF->512)
  - [6,  1, Conv, [512, 3, 2]]          # 11: P4 -> P5 downsample
  - [[-1, 10], 1, Concat, [1]]          # 12
  - [-1, 3, CSPStage, [512]]            # 13: F5  (建议 repeats=2，先稳再加深)

  - [13, 1, EUCB_SC, []]                # 14: F5 up -> P4
  - [-1, 1, Conv, [256, 1, 1]]          # 15: align(F5_up) -> 256

  - [4,  1, Conv, [256, 3, 2]]          # 16: P3 -> P4 downsample (256)
  - [6,  1, Conv, [256, 1, 1]]          # 17: align(P4_raw) -> 256

  - [[15, 16, 17], 1, Concat, [1]]      # 18: (256+256+256)
  - [-1, 3, CSPStage, [256]]            # 19: F4_mid  (输出 256 更稳)

  - [19, 1, EUCB_SC, []]                # 20: F4 up -> P3
  - [-1, 1, Conv, [128, 1, 1]]          # 21: align(F4_up) -> 128
  - [4,  1, Conv, [128, 1, 1]]          # 22: align(P3_raw) -> 128

  - [[21, 22], 1, Concat, [1]]          # 23
  - [-1, 3, CSPStage, [128]]            # 24: F3_mid

  - [24, 1, EUCB_SC, []]                # 25: F3 up -> P2
  - [-1, 1, Conv, [128, 1, 1]]          # 26: align(F3_up) -> 128
  - [2,  1, Conv, [128, 1, 1]]          # 27: align(P2_raw) -> 128

  - [[26, 27], 1, Concat, [1]]          # 28
  - [-1, 2, CSPStage, [128]]            # 29: F2

  - [24, 1, Conv, [256, 3, 2]]          # 30: F3_mid -> P4
  - [[-1, 19], 1, Concat, [1]]          # 31
  - [-1, 3, CSPStage, [256]]            # 32: F4_final

  - [32, 1, Conv, [512, 3, 2]]          # 33: F4_final -> P5
  - [[-1, 13], 1, Concat, [1]]          # 34
  - [-1, 3, CSPStage, [512]]            # 35: F5_final

  - [[29, 24, 32, 35], 1, Detect_LSCSBD, [nc, 256]]

