# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 极简版 - LSCSBD + EUCB_SC + C2f_iRMB_Lite
# 适合快速实验和显存受限场景
# 
# 特点：
# 1. 使用C2f_iRMB_Lite（极简版，速度最快）
# 2. 参数量最少（+10%）
# 3. 训练最稳定
# 4. 推理速度快（FPS仅降8%）

# Parameters
nc: 6  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f_iRMB_Lite, [128, 5, 0.25]]  # 2
  # args: [out_channels, kernel_size, se_ratio]
  
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f_iRMB_Lite, [256, 5, 0.25]]  # 4
  
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f_iRMB_Lite, [512, 5, 0.25]]  # 6
  
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f_iRMB_Lite, [1024, 5, 0.25]]  # 8
  
  - [-1, 1, SPPF, [1024, 5]]    # 9

# Head
head:
  # FPN上采样
  - [-1, 1, EUCB_SC, []]        # 10
  - [[-1, 6], 1, Concat, [1]]   # 11
  - [-1, 3, C2f_iRMB_Lite, [512, 5, 0.25]]  # 12
  
  - [-1, 1, EUCB_SC, []]        # 13
  - [[-1, 4], 1, Concat, [1]]   # 14
  - [-1, 3, C2f_iRMB_Lite, [256, 5, 0.25]]  # 15
  
  - [-1, 1, EUCB_SC, []]        # 16
  - [[-1, 2], 1, Concat, [1]]   # 17
  - [-1, 3, C2f_iRMB_Lite, [128, 5, 0.25]]  # 18 (P2)
  
  # PAN下采样
  - [-1, 1, Conv, [128, 3, 2]]  # 19
  - [[-1, 15], 1, Concat, [1]]  # 20
  - [-1, 3, C2f_iRMB_Lite, [256, 5, 0.25]]  # 21 (P3)
  
  - [-1, 1, Conv, [256, 3, 2]]  # 22
  - [[-1, 12], 1, Concat, [1]]  # 23
  - [-1, 3, C2f_iRMB_Lite, [512, 5, 0.25]]  # 24 (P4)
  
  - [-1, 1, Conv, [512, 3, 2]]  # 25
  - [[-1, 9], 1, Concat, [1]]   # 26
  - [-1, 3, C2f_iRMB_Lite, [1024, 5, 0.25]]  # 27 (P5)
  
  # 检测头
  - [[18, 21, 24, 27], 1, Detect_LSCSBD, [nc, 256]]  # 28

