# 绾?EUCB_SC 涓婇噰鏍凤紝LSCSBD 鍥涘ご

nc: 5
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, Conv, [512, 1, 1]]          # 10
  - [6,  1, Conv, [512, 3, 2]]          # 11
  - [[-1, 10], 1, Concat, [1]]          # 12
  - [-1, 2, CSPStage, [512]]            # 13

  - [13, 1, EUCB_SC, []]                # 14: P5->P4
  - [-1, 1, Conv, [256, 1, 1]]          # 15
  - [6,  1, Conv, [256, 1, 1]]          # 16
  - [[15, 16], 1, Concat, [1]]          # 17
  - [-1, 2, CSPStage, [256]]            # 18: F4 mid

  - [18, 1, EUCB_SC, []]                # 19: P4->P3
  - [-1, 1, Conv, [128, 1, 1]]          # 20
  - [4,  1, Conv, [128, 1, 1]]          # 21
  - [[20, 21], 1, Concat, [1]]          # 22
  - [-1, 2, CSPStage, [128]]            # 23: F3 mid

  - [23, 1, EUCB_SC, []]                # 24: P3->P2
  - [-1, 1, Conv, [128, 1, 1]]          # 25
  - [2,  1, Conv, [128, 1, 1]]          # 26
  - [[25, 26], 1, Concat, [1]]          # 27
  - [-1, 2, CSPStage, [128]]            # 28: F2

  - [23, 1, Conv, [256, 3, 2]]          # 29: F3->P4
  - [[29, 18], 1, Concat, [1]]          # 30
  - [-1, 2, CSPStage, [256]]            # 31: F4 final
  - [31, 1, Conv, [512, 3, 2]]          # 32: F4->P5
  - [[32], 1, Concat, [1]]          # asym-pruned P5 fusion (remove shallow->P5 skip)          # 33
  - [-1, 2, CSPStage, [512]]            # 34: F5 final

  - [[28, 23, 31, 34], 1, Detect_LSCSBD, [nc, 256]]  # Detect P2,P3,P4,P5
