# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 标准版 - 仅使用LSCSBD检测头（用于对比实验）
# 不使用C2f_iRMB和EUCB_SC，仅测试LSCSBD检测头的效果
# 对比试验出来的效果
# 用途：
# 1. 作为baseline对比
# 2. 验证LSCSBD单独的提升效果
# 3. 排除其他模块的影响

# Parameters
nc: 5  # number of classes
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# Backbone - 标准YOLOv8
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128]]         # 2 (标准C2f)
  
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256]]         # 4
  
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512]]         # 6
  
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024]]        # 8
  
  - [-1, 1, SPPF, [1024, 5]]    # 9

# Head - 标准上采样 + LSCSBD检测头
head:
  # FPN上采样（标准nn.Upsample）
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 10
  - [[-1, 6], 1, Concat, [1]]   # 11
  - [-1, 3, C2f, [512]]         # 12
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 13
  - [[-1, 4], 1, Concat, [1]]   # 14
  - [-1, 3, C2f, [256]]         # 15
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 16
  - [[-1, 2], 1, Concat, [1]]   # 17
  - [-1, 3, C2f, [128]]         # 18 (P2)
  
  # PAN下采样
  - [-1, 1, Conv, [128, 3, 2]]  # 19
  - [[-1, 15], 1, Concat, [1]]  # 20
  - [-1, 3, C2f, [256]]         # 21 (P3)
  
  - [-1, 1, Conv, [256, 3, 2]]  # 22
  - [[-1, 12], 1, Concat, [1]]  # 23
  - [-1, 3, C2f, [512]]         # 24 (P4)
  
  - [-1, 1, Conv, [512, 3, 2]]  # 25
  - [[-1, 9], 1, Concat, [1]]   # 26
  - [-1, 3, C2f, [1024]]        # 27 (P5)
  
  # 检测头（仅使用LSCSBD）
  - [[18, 21, 24, 27], 1, Detect_LSCSBD, [nc, 256]]  # 28

